import numpy as np

x, y, z = map(float, input().split())

# Всё вычислено заранее через вершины тетраэдра:
# тетраэдр PBCD
V1 = abs(-130*x - 35*y - 25*z + 140)

# тетраэдр APCD
V2 = abs(-80*x - 60*y - 160)

# тетраэдр ABPD
V3 = abs(90*x + 5*y - 25*z + 80)

# тетраэдр ABCP
V4 = abs(40*x + 30*y - 50*z - 120)

cond = V1+V2+V3+V4

print("YES" if cond == 500 else "NO")

#В данном коде я не стал вычислять объем каждого тетраэдра, несмотря на то, что назвал переменные V, просто потому что на сравнение это никак не влияет
#Если мы умножим обе части на 1/6(чтобы найти объем) результат не изменится