import re
from re import *

# №1 - 4

ss = "Киносеанс начнётся в 20:15. Фильм длится 2 часа 10 минут, так что в 22:25:01 уже будем выходить из зала."
ss1 = "Электричка отходит в 08:42. В 08:42:01 двери уже закроются."
ss2 = "Матч начнётся в 17:00. Первый тайм закончится в 17:45:00."
ss3 = "Тренировка по плаванию в 07:00. Бассейн будет доступен до 08:30:00."
s4 = "Самолёт вылетает в 06:25. Регистрация завершится в 05:55:00."


match1 = re.sub(r'(?:[0-1][0-9]|2[0-3]):[0-5][0-9](?::[0-5][0-9])?',"TBD",ss1)

print(match1)