-------------------------------------------------------- 1

SELECT Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_ТИПЫ_ВЕДОМОСТЕЙ.НАИМЕНОВАНИЕ FROM Н_ВЕДОМОСТИ
    LEFT JOIN Н_ТИПЫ_ВЕДОМОСТЕЙ ON Н_ВЕДОМОСТИ.ТВ_ИД = Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД WHERE (Н_ТИПЫ_ВЕДОМОСТЕЙ.НАИМЕНОВАНИЕ = 'Экзаменационный лист'
    and Н_ВЕДОМОСТИ.ИД = 1490007);

Н_ВЕДОМОСТИ.ИД < 1250972


-------------------------------------------------------- 2


SELECT Н_СЕССИЯ.ИД, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_ЛЮДИ.ОТЧЕСТВО FROM Н_ВЕДОМОСТИ
JOIN Н_ЛЮДИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД JOIN Н_СЕССИЯ ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
WHERE (Н_ЛЮДИ.ИМЯ = 'Ярослав' and  Н_ВЕДОМОСТИ.ДАТА > '2022-06-08');


SELECT Н_ЛЮДИ.ИД FROM Н_ВЕДОМОСТИ
JOIN Н_ЛЮДИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД WHERE (Н_ЛЮДИ.ИМЯ = 'Ярослав' and  Н_ВЕДОМОСТИ.ДАТА < '2022-06-08');
-------------------------------------------------------- 3

SELECT Н_ЛЮДИ.ИД FROM Н_УЧЕНИКИ
JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE (date_part('year',AGE(CURRENT_DATE,Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ)) < 20 and Н_УЧЕНИКИ.ГРУППА = '3102');

-------------------------------------------------------- 4

SELECT Н_ЛЮДИ.ИМЯ, count(Н_ЛЮДИ.ИМЯ) as количество FROM Н_ФОРМЫ_ОБУЧЕНИЯ
JOIN Н_ПЛАНЫ ON Н_ФОРМЫ_ОБУЧЕНИЯ.ИД = Н_ПЛАНЫ.ФО_ИД
JOIN Н_УЧЕНИКИ ON Н_ПЛАНЫ.ИД = Н_УЧЕНИКИ.ПЛАН_ИД
JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.ИД = 3
GROUP BY Н_ЛЮДИ.ИМЯ HAVING count(Н_ЛЮДИ.ИМЯ) > 10

-------------------------------------------------------- 5

SELECT Н_ЛЮДИ.ИД, concat(Н_ЛЮДИ.ФАМИЛИЯ,' ' ,Н_ЛЮДИ.ИМЯ, ' ' ,Н_ЛЮДИ.ОТЧЕСТВО) as ФИО, round(avg(CAST(Н_ВЕДОМОСТИ.ОЦЕНКА  AS NUMERIC))) as СР_ОЦЕНКА FROM Н_УЧЕНИКИ
JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД JOIN Н_ЛЮДИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE Н_УЧЕНИКИ.ГРУППА = '4100' and Н_ВЕДОМОСТИ.ОЦЕНКА IN('2', '3', '4', '5')
GROUP BY Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО
HAVING round(avg(CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS NUMERIC))) = (SELECT max(CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS NUMERIC)) FROM Н_ВЕДОМОСТИ
JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД WHERE Н_УЧЕНИКИ.ГРУППА = '1100' and Н_ВЕДОМОСТИ.ОЦЕНКА IN('2', '3', '4', '5'))

-------------------------------------------------------- 6

SELECT Н_УЧЕНИКИ.ГРУППА,Н_ЛЮДИ.ИД, concat(Н_ЛЮДИ.ФАМИЛИЯ, ' ',Н_ЛЮДИ.ИМЯ, ' ',Н_ЛЮДИ.ОТЧЕСТВО) as ФИО, Н_ВЕДОМОСТИ.НОМЕР_ДОКУМЕНТА, Н_УЧЕНИКИ.СОСТОЯНИЕ FROM Н_ПЛАНЫ
JOIN Н_УЧЕНИКИ ON Н_ПЛАНЫ.ПЛАН_ИД = Н_УЧЕНИКИ.ПЛАН_ИД
JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
JOIN Н_ЛЮДИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE Н_ПЛАНЫ.ФО_ИД IN (1,3) and (Н_УЧЕНИКИ.НАЧАЛО - ((Н_ПЛАНЫ.КУРС -1 ) * INTERVAL '1 year') < '2012-09-01'::DATE);


-------------------------------------------------------- 7

SELECT count(*) FROM Н_ВЕДОМОСТИ
JOIN Н_УЧЕНИКИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ПЛАН_ИД
JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ОТД_ИД
WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'ФКТИУ' and Н_ВЕДОМОСТИ.ОЦЕНКА = '3';
